import React from "react";

//маягт СТ2 Хавсралт-10
function CT2_10() {
  const styles = {
    generalText: {
      fontSize: 12,
    },
    rowStyle: {
      fontSize: 12,
      marginTop: 10,
    },
    leftText: {
      fontSize: 12,
    },
    centerText: {
      textAlign: "center",
      verticalAlign: "middle",
      fontSize: 12,
      padding: 0,
      marginTop: 10,
    },
    rightText: {
      textAlign: "right",
      fontSize: 12,
    },
  };
  return (
    <>
      <div className="page">
        <div className="subpage">
          <span
            style={{
              ...styles.generalText,
              ...{ textAlign: "right", display: "block" },
            }}
          >
            Эрүүл мэндийн сайдын 2019 оны 12 дугаар сарын 30-ны өдрийн
          </span>
          <div
            style={{
              display: "flex",
              flexDirection: "row",
              justifyContent: "flex-end",
            }}
          >
            <div
              style={{
                display: "flex",
                flexDirection: "column",
                textAlign: "right",
              }}
            >
              <span style={styles.generalText}>
                A/611 дүгээр тушаалын арваннэгдүгээр хавсралт
              </span>
              <span style={{ fontWeight: "bold", fontSize: 14 }}>
                Эрүүл мэндийн бүртгэлийн маягт СТ2 Хавсралт-10
              </span>
            </div>
          </div>

          <div style={{ textAlign: "center", marginTop: 15, marginBottom: 15 }}>
            <span style={{ fontWeight: "bold", fontSize: 16 }}>
              ӨӨРИЙН ХҮСЭЛТЭЭР ЭМНЭЛГЭЭС ГАРАХ ТУХАЙ ЗӨВШӨӨРЛИЙН ХУУДАС
            </span>
          </div>
          <div style={styles.rightText}>
            (Өвчтөний түүх/иргэний эрүүл мэндийн дэвтэрт хавсаргана)
          </div>
          <div style={styles.leftText}>
            ҮЙЛЧЛҮҮЛЭГЧ ______________________________овогтой
            _____________________________ би эмчийн зөвшөөрсөн
          </div>
          <div style={styles.leftText}>
            хугацаанаас өмнө эмнэлгээс гарах нь эмчлэгч эмч болон эмнэлгийн
            удирдлагын зааврыг дагаж мөрдөөгүй гэдгийг ойлгож байна.
          </div>
          <div style={styles.rowStyle}>Миний эмнэлгээс гарч буй шалтгаан:</div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Энэ мөчид эмнэлгээс гарснаар миний биед гарч болох хүндрэлүүдийн
            талаар дараах МЭДЭЭЛЛИЙГ БИ АВСАН БОЛНО.
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Дээр дурдсан хүндрэлийн жагсаалт нь бүрэн бус гэдгийг БИ ОЙЛГОСОН
            бөгөөд хэрвээ би хүссэн тохиолдолд нэмэлт мэдээлэл авч болно гэдгийг
            МЭДЭЖ БАЙНА.
          </div>
          <div style={styles.rowStyle}>
            Энэ мөчид эмнэлгээс гарч, тусламж үйлчилгээ зогссоноос болж гарах үр
            дагаварт эмчлэгч эмч, эмнэлгийг буруутгахгүй.
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгчийн гарын үсэг
            ____________________________________/................................................/
          </div>
          <div style={styles.generalText}>
            Үйлчлүүлэгч гарын үсэг зурах эрх зүйн чадамжгүй бол:
          </div>
          <div style={styles.rowStyle}>
            Асран хамгаалагч/харгалзан дэмжигчийн гарын үсэг
            ____________________________________/................................................/
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгчтэй холбоотой эсэх: _____________________________________
          </div>

          <div style={styles.rowStyle}>
            Үйлчлүүлэгч эрх зүйн чадамжгүй байгаа шалтгаан:
          </div>
          <div style={styles.rowStyle}>[ &nbsp; ] Насанд хүрээгүй</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Ухаангүй</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Сэтгэцийн эмгэгтэй</div>
          <div style={styles.rowStyle}>
            [ &nbsp; ] Бусад (тайлбарлана уу)
            ………………………………………………………………………………………………………………………………
          </div>
          <div style={styles.rowStyle}>Хэрэв өвчтөн жирэмсэн тохиолдолд:</div>
          <div style={styles.rowStyle}>
            Миний эхнэрийн хийлгэхээр зөвшөөрсөн мэс ажилбар/мэс заслын хагалгаа
            (аль нь болохыг сонгож доогуур нь зурах)-ыг би зөвшөөрч байна.
          </div>
          <div style={styles.rowStyle}>
            Нөхрийн (асран хамгаалагч/харгалзан дэмжигч) гарын үсэг:
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>
            Хэрэв нөхөр (асран хамгаалагч/харгалзан дэмжигч) нь зөвшөөрөөгүй бол
            тайлбарлана уу
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Энэхүү зөвшөөрлийн хуудасны загварыг 2 хувь үйлдсэн болно.
          </div>
          <div style={styles.centerText}>
            огноо: ________ он _______ сар _______
          </div>
        </div>
      </div>
    </>
  );
}

export default CT2_10;
