import React from "react";

//маягт СТ2 Хавсралт-9
function СТ2_9() {
  const styles = {
    generalText: {
      fontSize: 12,
    },
    rowStyle: {
      fontSize: 12,
      marginTop: 10,
    },
    leftText: {
      fontSize: 12,
    },
    centerText: {
      textAlign: "center",
      verticalAlign: "middle",
      fontSize: 12,
      padding: 0,
      marginTop: 10,
    },
    rightText: {
      textAlign: "right",
      fontSize: 12,
    },
  };
  return (
    <>
      <div className="page">
        <div className="subpage">
          <span
            style={{
              ...styles.generalText,
              ...{ textAlign: "right", display: "block" },
            }}
          >
            Эрүүл мэндийн сайдын 2019 оны 12 дугаар сарын 30-ны өдрийн
          </span>
          <div
            style={{
              display: "flex",
              flexDirection: "row",
              justifyContent: "flex-end",
            }}
          >
            <div
              style={{
                display: "flex",
                flexDirection: "column",
                textAlign: "right",
              }}
            >
              <span style={styles.generalText}>
                A/611 дүгээр тушаалын арваннэгдүгээр хавсралт
              </span>
              <span style={{ fontWeight: "bold", fontSize: 14 }}>
                Эрүүл мэндийн бүртгэлийн маягт СТ2 Хавсралт-9
              </span>
            </div>
          </div>

          <div style={{ textAlign: "center", marginTop: 15, marginBottom: 15 }}>
            <span style={{ fontWeight: "bold", fontSize: 16 }}>
              АМЬ НАС/ЭРҮҮЛ МЭНДЭД ЭРСДЭЛТЭЙ ТУСЛАМЖ ҮЙЛЧИЛГЭЭ ҮЗҮҮЛЭХ
              ЗӨВШӨӨРЛИЙН ХУУДАС
            </span>
          </div>
          <div style={styles.rightText}>
            (Өвчтөний түүх/иргэний эрүүл мэндийн дэвтэрт хавсаргана)
          </div>
          <div style={styles.rowStyle}>А/МЭДЭЭЛЛИЙН ХУУДАС</div>
          <div style={styles.leftText}>
            Санал болгож буй оношилгооны ажилбар/эмчилгээ:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Санал болгож буй оношилгооны ажилбар/эмчилгээ (аль нь болохыг сонгож
            доогуур нь зурах) -ын үр дүн (эмнэл зүйн туршлагын дүн, нотолгоонд
            тулгуурлан бүрэн эдгэрэлт, сайжралт, эндэгдэл, хүндрэлийн магадлалыг
            хувиар илирхийлэн ойлгомжтойгоор тайлбарлана):
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Гарч болох эрсдэлүүдийг нэг бүрчлэн дурьдана:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Гарч болох хүндрэлүүдийг нэг бүрчлэн дурьдана:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Тухайн оношилгооны ажилбар/эмчилгээний үед хийгдэж болох нэмэлт
            ажилбаруудыг нэг бүрчлэн дурьдана:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Тухайн оношилгооны ажилбар/эмчилгээ (аль нь болохыг сонгож доогуур
            нь зурах)-ыг орлуулж болох эмчилгээний бусад аргуудыг дурьдана:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Санал болгож буй оношилгооны ажилбар/эмчилгээний давуу тал:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Санал болгож буйоношилгооны ажилбар/эмчилгээний үед хийгдэж болох
            мэдээгүйжүүлэлт:
          </div>
          <div style={styles.rowStyle}>[ &nbsp; ] Ерөнхий</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Нугасны мэдээ алдуулалт</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Хэсгийн мэдээ алдуулалт</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Тайвшруулах</div>
          <div style={styles.rowStyle}>Үйлчлүүлэгчээс тавьсан асуулт:</div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>Дээрх асуултын хариулт (товч):</div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
        </div>
      </div>
      <div className="page">
        <div className="subpage">
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Эмчтэй холбоо барих утас:
            _____________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Би үйлчлүүлэгчдээ дээрх мэдээллүүдийг дэлгэрэнгүй, энгийн ойлгомжтой
            хэллэгээр тайлбарлаж өгсөн болно.
          </div>
          <div style={styles.rowStyle}>
            Эмчийн гарын үсэг
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>Б/ҮЙЛЧЛҮҮЛЭГЧИЙН ЗӨВШӨӨРӨЛ:</div>
          <div style={styles.rowStyle}>
            [ &nbsp; ] Надад шаардлагатай оношилгооны ажилбар/эмчилгээ (аль нь
            болохыг сонгож доогуур нь зурах)-ний талаар эмчийн өгсөн
            мэдээллүүдийг БИ ОЙЛГОСОН. Иймд
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>хийлгэхийг ЗӨВШӨӨРЧ БАЙНА.</div>
          <div style={styles.generalText}>
            [ &nbsp; ] Эмчийн санал болгосон оношилгооны ажилбар/эмчилгээ
            (зурах)-аас гадна
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            зэрэг нэмэлт ажилбар болон орлуулах эмчилгээ нь зөвхөн миний амь
            насыг аврах болон миний биеийн байдлыг муудахаас сэргийлэхийн тулд
            хийнэ гэдгийг БИ ОЙЛГОЖ БАЙНА.
          </div>
          <div style={styles.generalText}>
            [ &nbsp; ] Харин дараах ажилбаруудыг ХИЙЛГЭХИЙГ БИ ЗӨВШӨӨРӨХГҮЙ
            БАЙНА
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгчийн гарын үсэг
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгч гарын үсэг зурах эрх зүйн чадамжгүй бол:
          </div>
          <div style={styles.rowStyle}>
            Асран хамгаалагч/харгалзан дэмжигчийн гарын үсэг
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгчтэй холбоотой эсэх: ___________________________
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгч эрх зүйн чадамжгүй байгаа шалтгаан:
          </div>
          <div style={styles.rowStyle}>[ &nbsp; ] Насанд хүрээгүй</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Ухаангүй</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Сэтгэцийн эмгэгтэй</div>
          <div style={styles.rowStyle}>
            [ &nbsp; ] Бусад (тайлбарлана уу)
            ………………………………………………………………………………………………………………………………
          </div>
          <div style={styles.rowStyle}>Хэрэв өвчтөн жирэмсэн тохиолдолд:</div>
          <div style={styles.rowStyle}>
            Миний эхнэрийн хийлгэхээр зөвшөөрсөн мэс ажилбар/мэс заслын хагалгаа
            (аль нь болохыг сонгож доогуур нь зурах)-ыг би зөвшөөрч байна.
          </div>
          <div style={styles.rowStyle}>
            Нөхрийн (асран хамгаалагч/харгалзан дэмжигч) гарын үсэг:
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>
            Хэрэв нөхөр (асран хамгаалагч/харгалзан дэмжигч) нь зөвшөөрөөгүй бол
            тайлбарлана уу
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Энэхүү зөвшөөрлийн хуудасны загварыг 2 хувь үйлдсэн болно.
          </div>
          <div style={styles.centerText}>
            огноо: ________ он _______ сар _______
          </div>
        </div>
      </div>
    </>
  );
}

export default СТ2_9;
