import React from "react";

//маягт СТ2 Хавсралт-11
function СТ2_11() {
  const styles = {
    generalText: {
      fontSize: 12,
    },
    rowStyle: {
      fontSize: 12,
      marginTop: 10,
    },
    centerText: {
      textAlign: "center",
      verticalAlign: "middle",
      fontSize: 12,
      padding: 0,
      marginTop: 10,
    },
    rightText: {
      textAlign: "right",
      fontSize: 12,
    },
  };
  return (
    <>
      <div className="page">
        <div className="subpage">
          <span
            style={{
              ...styles.generalText,
              ...{ textAlign: "right", display: "block" },
            }}
          >
            Эрүүл мэндийн сайдын 2019 оны 12 дугаар сарын 30-ны өдрийн
          </span>
          <div
            style={{
              display: "flex",
              flexDirection: "row",
              justifyContent: "flex-end",
            }}
          >
            <div
              style={{
                display: "flex",
                flexDirection: "column",
                textAlign: "right",
              }}
            >
              <span style={styles.generalText}>
                A/611 дүгээр тушаалын арваннэгдүгээр хавсралт
              </span>
              <span style={{ fontWeight: "bold", fontSize: 14 }}>
                Эрүүл мэндийн бүртгэлийн маягт СТ2 Хавсралт-11
              </span>
            </div>
          </div>

          <div style={{ textAlign: "center", marginTop: 15, marginBottom: 15 }}>
            <span style={{ fontWeight: "bold", fontSize: 16 }}>
              ӨӨРИЙН ХҮСЭЛТЭЭР ЭРҮҮЛ МЭНДИЙН ТУСЛАМЖ ҮЙЛЧИЛГЭЭ АВАХ ТУХАЙ
              ЗӨВШӨӨРЛИЙН ХУУДАС
            </span>
          </div>
          <div style={styles.rightText}>
            (Өвчтөний түүх/иргэний эрүүл мэндийн дэвтэрт хавсаргана)
          </div>
          <div style={styles.rowStyle}>
            ҮЙЛЧЛҮҮЛЭГЧ __________________________овогтой
            _________________________ би дараах эмчилгээ
          </div>
          <div style={styles.rowStyle}>
            үйлчилгээ авах хүсэлтэй байна. (ямар тусламж, үйлчилгээ авах
            саналтай байгаагаа дэлгэрэнгүй бичнэ. Үүнд: эмийн эмчилгээ, мэс
            ажилбар, гоо сайхны хагалгаа зэрэг бүх үйлчилгээ хамаарна)
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Миний зүгээс уг эмчилгээ, үйлчилгээг хийлгэх гэж буй шалтгаан:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Өөрийн хүсэлтээр хийлгэж буй оношилгооны ажилбар/эмчилгээ (аль нь
            болохыг сонгож доогуур нь зурах)-ний үр дүн (эмнэл зүйн туршлагын
            дүн, нотолгоонд тулгуурлан бүрэн эдгэрэлт, сайжралт, эндэгдэл,
            хүндрэлийн магадлалыг хувиар илэрхийлэн ойлгомжтойгоор тайлбарлана):
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Гарч болох эрсдэлүүдийг нэг бүрчлэн дурьдана:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Гарч болох хүндрэлүүдийг нэг бүрчлэн дурьдана:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Тухайн оношилгооны ажилбар/эмчилгээ(аль нь болохыг сонгож доогуур нь
            зурах)-ний үед хийгдэж болох нэмэлт ажилбаруудыг нэг бүрчлэн
            дурьдана:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Тухайн оношилгооны ажилбар/эмчилгээ (аль нь болохыг сонгож доогуур
            нь зурах)-ыг орлуулж болох эмчилгээний бусад аргуудыг дурьдана:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Санал болгож буй оношилгооны ажилбар/эмчилгээ (аль нь болохыг сонгож
            доогуур нь зурах)-ний давуу тал:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Санал болгож буйоношилгооны ажилбар/эмчилгээ (аль нь болохыг сонгож
            доогуур нь зурах)-ний үед хийгдэж болох мэдээгүйжүүлэлт:
          </div>
          <div style={styles.rowStyle}>[ &nbsp; ] Ерөнхий</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Нугасны мэдээ алдуулалт</div>
        </div>
      </div>
      <div className="page">
        <div className="subpage">
          <div style={styles.rowStyle}>[ &nbsp; ] Хэсгийн мэдээ алдуулалт</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Тайвшруулах</div>
          <div style={styles.rowStyle}>Үйлчлүүлэгчээс тавьсан асуулт:</div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>Дээрх асуултын хариулт (товч):</div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Эмчтэй холбоо барих утас:
            ___________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Би үйлчлүүлэгчдээ дээрх мэдээллүүдийг дэлгэрэнгүй, энгийн ойлгомжтой
            хэллэгээр тайлбарлаж өгсөн болно.
          </div>
          <div style={styles.rowStyle}>
            Эмчийн гарын үсэг
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>Б/ҮЙЛЧЛҮҮЛЭГЧИЙН ЗӨВШӨӨРӨЛ:</div>
          <div style={styles.rowStyle}>
            [ &nbsp; ] Миний хүсэлтээр хийж буй оношилгооны ажилбар/эмчилгээ
            (аль нь болохыг сонгож доогуур нь зурах)-ний талаар эмчийн өгсөн
            мэдээллүүдийг БИ ОЙЛГОСОН
          </div>
          <div style={styles.rowStyle}>
            Иймд
            ____________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>хийлгэхийг ЗӨВШӨӨРЧ БАЙНА.</div>
          <div style={styles.rowStyle}>
            [ &nbsp; ] Эмчийн санал болгосон оношилгооны ажилбар/эмчилгээ (аль
            нь болохыг сонгож доогуур нь зурах)-нээс гадна
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            зэрэг нэмэлт ажилбар болон орлуулах эмчилгээ нь зөвхөн миний амь
            насыг аврах болон миний биеийн байдлыг муудахаас сэргийлэхийн тулд
            хийнэ гэдгийг БИ ОЙЛГОЖ БАЙНА.
          </div>
          <div style={styles.rowStyle}>
            [ &nbsp; ] Харин дараах ажилбаруудыг ХИЙЛГЭХИЙГ БИ ЗӨВШӨӨРӨХГҮЙ
            БАЙНА.
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгчийн гарын үсэг
            ___________________________________/............................................../
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгч гарын үсэг зурах эрх зүйн чадамжгүй бол:
          </div>
          <div style={styles.rowStyle}>
            Асран хамгаалагч/харгалзан дэмжигчийн гарын үсэг
            ___________________________________/............................................../
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгчтэй холбоотой эсэх: ___________________________
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгч эрх зүйн чадамжгүй байгаа шалтгаан:
          </div>
          <div style={styles.rowStyle}>[ &nbsp; ] Насанд хүрээгүй</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Ухаангүй</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Сэтгэцийн эмгэгтэй</div>
          <div style={styles.rowStyle}>
            [ &nbsp; ] Бусад (тайлбарлана уу)
            ………………………………………………………………………………………………………………………………
          </div>
          <div style={styles.rowStyle}>Хэрэв өвчтөн жирэмсэн тохиолдолд:</div>
        </div>
      </div>
      <div className="page">
        <div className="subpage">
          <div style={styles.rowStyle}>
            Миний эхнэрийн хийлгэхээр зөвшөөрсөн мэс заслын хагалгааг би мөн
            зөвшөөрч байна.
          </div>
          <div style={styles.rowStyle}>
            Нөхрийн (асран хамгаалагч/харгалзан дэмжигч) гарын үсэг:
            ___________________________________/............................................../
          </div>
          <div style={styles.rowStyle}>
            Хэрэв нөхөр (асран хамгаалагч/харгалзан дэмжигч) нь зөвшөөрөөгүй бол
            тайлбарлана уу.
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Энэхүү зөвшөөрлийн хуудасны загварыг 2 хувь үйлдсэн болно.
          </div>
          <div style={styles.centerText}>
            огноо: ________ он _______ сар _______
          </div>
        </div>
      </div>
    </>
  );
}

export default СТ2_11;
