import React from "react";

//маягт СТ-21А
function СТ_21А() {
  const styles = {
    headerText: {
      fontSize: 12,
      lineHeight: 1.1,
    },
    rowStyle: {
      fontSize: 12,
      lineHeight: 1.2,
      marginTop: 15,
    },
  };
  return (
    <>
      <div className="page">
        <div className="subpage">
          <div
            style={{
              display: "flex",
              flexDirection: "column",
              textAlign: "right",
            }}
          >
            <div style={styles.headerText}>
              Эрүүл мэндийн сайдын 2019 оны 12 дугаар сарын 30-ны
            </div>
            <div style={styles.headerText}>
              өдрийн A/611 дүгээр тушаалын арваннэгдүгээр хавсралт
            </div>
            <div style={{ ...styles.headerText, ...{ fontWeight: "bold" } }}>
              Эрүүл мэндийн бүртгэлийн маягт СТ-21А
            </div>
          </div>
          <div style={{ textAlign: "center", marginTop: 5, marginBottom: 5 }}>
            <span style={{ fontWeight: "bold", fontSize: 12 }}>
              УРВАЛ, ГАРАХ ШАХСАН ТОХИОЛДОЛ, ҮЛ ТОХИРЛЫГ БҮРТГЭХ МАЯГТ
            </span>
          </div>
          <div style={styles.rowStyle}>
            <b>
              Эрүүл мэндийн байгууллагын нэр:
              ........................................................................................
            </b>
          </div>
          <div style={styles.rowStyle}>
            <b>
              Тасгийн
              нэр:........................................................................................
            </b>
          </div>
          <div style={styles.rowStyle}>
            <b>
              Эмч, мэргэжилтний (зур ) Эцэг/эх/-ийн нэр
              ........................... Өөрийн нэр............................
            </b>
          </div>
          <div style={styles.rowStyle}>
            <b>
              Огноо
              (он/сар/өдөр):..........................................................................................................
            </b>
          </div>
          <div style={styles.rowStyle}>
            <b>
              Сэлбэсэн
              бүтээгдэхүүн:....................................................................................................
            </b>
          </div>
          <div style={styles.rowStyle}>
            <b>
              Улаан эсийн бүтээгдэхүүн:
              ..............................................................................................
            </b>
          </div>
          <div style={styles.rowStyle}>
            <b>
              Сийвэнгийн бүтээгдэхүүн:
              ................................................................................................
            </b>
          </div>
          <div style={styles.rowStyle}>
            <b>
              Эсийн бүтээгдэхүүн:
              ..........................................................................................................
            </b>
          </div>
          <div style={styles.rowStyle}>
            <b>Урвалын хэлбэр</b>
          </div>
          <div style={styles.rowStyle}>
            ....................................................................................................................................................................................
          </div>
          <div style={styles.rowStyle}>
            <b>Үл тохирол, алдаа гарах шахсан тохиолдол</b>
          </div>
          <div style={styles.rowStyle}>
            ....................................................................................................................................................................................
          </div>
          <div style={styles.rowStyle}>
            <b>Үл тохирол</b>
          </div>
          <div style={styles.rowStyle}>
            ....................................................................................................................................................................................
          </div>
          <div style={styles.rowStyle}>
            <b>Бүртгэсэн огноо </b>
            (он/сар/өдөр):.......................................................................................
          </div>
          <div style={styles.rowStyle}>
            <b>Тайлбар: </b>Энэ маягтыг сөрөг урвал, гарах шахсан тохиолдол, үл
            тохирлыг илрүүлсэн эмч, мэргэжилтэн бөглөнө.
          </div>
        </div>
      </div>
    </>
  );
}

export default СТ_21А;
