import React from "react";

//маягт СТ2 Хавсралт-8
function СТ2_8() {
  const styles = {
    generalText: {
      fontSize: 12,
    },
    rowStyle: {
      fontSize: 12,
      marginTop: 10,
    },
    leftText: {
      fontSize: 12,
    },
    centerText: {
      textAlign: "center",
      verticalAlign: "middle",
      fontSize: 12,
      padding: 0,
      marginTop: 10,
    },
    rightText: {
      textAlign: "right",
      fontSize: 12,
    },
  };
  return (
    <>
      <div className="page">
        <div className="subpage">
          <span
            style={{
              ...styles.generalText,
              ...{ textAlign: "right", display: "block" },
            }}
          >
            Эрүүл мэндийн сайдын 2019 оны 12 дугаар сарын 30-ны өдрийн
          </span>
          <div
            style={{
              display: "flex",
              flexDirection: "row",
              justifyContent: "flex-end",
            }}
          >
            <div
              style={{
                display: "flex",
                flexDirection: "column",
                textAlign: "right",
              }}
            >
              <span style={styles.generalText}>
                A/611 дүгээр тушаалын арваннэгдүгээр хавсралт
              </span>
              <span style={{ fontWeight: "bold", fontSize: 14 }}>
                Эрүүл мэндийн бүртгэлийн маягт СТ2 Хавсралт-8
              </span>
            </div>
          </div>

          <div style={{ textAlign: "center", marginTop: 15, marginBottom: 15 }}>
            <span style={{ fontWeight: "bold", fontSize: 16 }}>
              МЭС ЗАСАЛ/МЭС АЖИЛБАР ХИЙЛГЭХ ТУХАЙ ЗӨВШӨӨРЛИЙН ХУУДАС
            </span>
          </div>
          <div style={styles.rightText}>
            (Өвчтөний түүх/иргэний эрүүл мэндийн дэвтэрт хавсаргана)
          </div>
          <div style={styles.rowStyle}>А/МЭДЭЭЛЛИЙН ХУУДАС</div>
          <div style={styles.leftText}>
            Санал болгож буй мэс засал/мэс ажилбарын нэр:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Санал болгож буй мэс засал/мэс ажилбар (аль нь болохыг сонгож
            доогуур нь зурах)-ын үр дүн (эмнэл зүйн туршлагын дүн, нотолгоонд
            тулгуурлан бүрэн эдгэрэлт, сайжралт, эндэгдэл, хүндрэлийн магадлалыг
            хувиар илирхийлэн ойлгомжтойгоор тайлбарлана):
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Гарч болох эрсдлүүд (эрсдэлүүдийг нэг бүрчлэн дурьдана):
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Гарч болох хүндрэлүүд (хүндрэлүүдийг нэг бүрчлэн дурьдана):
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Тухайн мэс засал/мэс ажилбарын үед хийгдэж болох нэмэлт ажилбарууд
            (ажилбаруудыг нэг бүрчлэн дурьдана):
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Тухайн мэс засал/мэс ажилбар (аль нь болохыг сонгож доогуур нь
            зурах)-ыг орлуулж болох эмчилгээний бусад аргууд (бусад аргуудыг
            дурьдана):
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Санал болгож буй мэс засал/мэс ажилбарын давуу тал:
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.generalText}>
            Санал болгож буй мэс засал/мэс ажилбарын үед хийгдэх
            мэдээгүйжүүлэлт:
          </div>
          <div style={styles.rowStyle}>
            Ерөнхий, нугасны мэдээ алдуулалт, хэсгийн мэдээ алдуулалт,
            тайвшруулах (аль нь болохыг сонгож доогуур нь харах)
          </div>
          <div style={styles.rowStyle}>Үйлчлүүлэгчээс тавьсан асуулт:</div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>Дээрх асуултын хариулт (товч):</div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Эмчтэй холбоо барих
            утас:____________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Би үйлчлүүлэгчдээ дээрх мэдээллүүдийг дэлгэрэнгүй, энгийн ойлгомжтой
            хэллэгээр тайлбарлаж өгсөн болно.
          </div>
        </div>
      </div>
      <div className="page">
        <div className="subpage">
          <div style={styles.rowStyle}>
            Эмчийн гарын үсэг
            _______________________________/................................................./
          </div>

          <div style={styles.rowStyle}>Б/ҮЙЛЧЛҮҮЛЭГЧИЙН ЗӨВШӨӨРӨЛ:</div>
          <div style={styles.rowStyle}>
            - Эмчийн санал болгож буй мэс засал/мэс ажилбар (аль нь болохыг
            сонгож доогуур нь зурах) -ыг дээрхи мэдээ алдуулалтаар хийлгэхийг БИ
            ЗӨВШӨӨРЧ БАЙНА.
          </div>
          <div style={styles.generalText}>
            Түүнчлэн гэмтсэн эд, эрхтний хэсэг болон эд эрхтнийг журмын дагуу
            устгахыг уг эмнэлэгт зөвшөөрч байна.
          </div>
          <div style={styles.generalText}>
            - Мэс засал/мэс ажилбар (аль нь болохыг сонгож доогуур нь зурах)-ын
            үр дүн, гарч болох хүндрэл, эрсдэл, нэмэлт ажилбарууд, орлуулж болох
            эмчилгээний талаар БИ ТОДОРХОЙ МЭДЭЭЛЭЛ АВСАН БОЛНО.
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгчийн гарын үсэг
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгч гарын үсэг зурах эрх зүйн чадамжгүй бол:
          </div>
          <div style={styles.rowStyle}>
            Асран хамгаалагч/харгалзан дэмжигчийн гарын үсэг
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгчтэй холбоотой эсэх: ___________________________
          </div>
          <div style={styles.rowStyle}>
            Үйлчлүүлэгч эрх зүйн чадамжгүй байгаа шалтгаан:
          </div>
          <div style={styles.rowStyle}>[ &nbsp; ] Насанд хүрээгүй</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Ухаангүй</div>
          <div style={styles.rowStyle}>[ &nbsp; ] Сэтгэцийн эмгэгтэй</div>
          <div style={styles.rowStyle}>
            [ &nbsp; ] Бусад (тайлбарлана уу)
            ………………………………………………………………………………………………………………………………
          </div>
          <div style={styles.rowStyle}>Хэрэв өвчтөн жирэмсэн тохиолдолд:</div>
          <div style={styles.rowStyle}>
            Миний эхнэрийн хийлгэхээр зөвшөөрсөн мэс ажилбар/мэс заслын хагалгаа
            (аль нь болохыг сонгож доогуур нь зурах)-ыг би зөвшөөрч байна.
          </div>
          <div style={styles.rowStyle}>
            Нөхрийн (асран хамгаалагч/харгалзан дэмжигч) гарын үсэг:
            _______________________________/................................................./
          </div>
          <div style={styles.rowStyle}>
            Хэрэв нөхөр (асран хамгаалагч/харгалзан дэмжигч) нь зөвшөөрөөгүй бол
            тайлбарлана уу
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            ____________________________________________________________________________________________________________________________________________
          </div>
          <div style={styles.rowStyle}>
            Энэхүү зөвшөөрлийн хуудасны загварыг 2 хувь үйлдсэн болно.
          </div>
          <div style={styles.centerText}>
            огноо: ________ он _______ сар _______
          </div>
        </div>
      </div>
    </>
  );
}

export default СТ2_8;
